# Taps
tap "homebrew/cask-fonts"
# Formulae
# GNU core utilities (those that come with OS X are outdated)
brew "coreutils"
brew "moreutils"
# GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "findutils"
# GNU `sed`, overwriting the built-in `sed`
brew "gnu-sed"
brew "imagemagick"
brew "ffmpeg"
brew "wget"
brew "bash"
brew "bash-completion@2"
brew "brew-cask-completion"
brew "git"
brew "git-extras"
brew "gnupg@2.2"
brew "pinentry-mac"
brew "grep"
brew "bat"
brew "prettyping"
brew "hub"
brew "ripgrep"
brew "fd"
# brew "openssh"
brew "screen"
brew "htop"
brew "nano"
brew "gnupg"
brew "tree"
brew "zopfli"
brew "brotli"
brew "node"
brew "yarn"
brew "ncdu" # find where your diskspace went
brew "terminal-notifier"
brew "rename"
brew "ssh-copy-id"
brew "woff2"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "fzf"
brew "diff-so-fancy"
brew "starship"
brew "scrcpy"
brew "zoxide"
brew "cloudflared"
brew "postgresql"

# Cask apps
cask_args appdir: "/Applications"
cask "1password"
cask "android-platform-tools"
cask "adobe-acrobat-reader"
cask "alfred"
cask "discord"
cask "docker"
cask "firefox"
cask "gitkraken"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "keepingyouawake"
cask "notion"
cask "postman"
cask "sensiblesidebuttons"
cask "signal"
cask "slack"
cask "rectangle"
cask "teamviewer"
cask "telegram"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-sans"
# Quicklook
cask "qlcolorcode" 
cask "qlstephen" 
cask "qlmarkdown" 
cask "quicklook-json" 
cask "qlprettypatch" 
cask "quicklook-csv" 
cask "the-unarchiver" 
cask "qlimagesize" 
cask "suspicious-package"
cask "quicklookase" 
cask "qlvideo"
# App Store apps
# mas "Trello", id: 1278508951