# Taps
tap "homebrew/core"
#tap "homebrew/bundle"
#tap "homebrew/drivers"
tap "homebrew/fonts"
#tap "homebrew/cask"
tap "bramstein/webfonttools"
# Formulae
# GNU core utilities (those that come with OS X are outdated)
brew "coreutils"
brew "moreutils"
# GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "findutils"
# GNU `sed`, overwriting the built-in `sed`
brew "gnu-sed"
brew "imagemagick"
brew "ffmpeg"
brew "wget"
brew "bash"
brew "bash-completion2"
brew "brew-cask-completion"
brew "git"
brew "git-extras"
brew "gnupg"
brew "pinentry-mac"
brew "grep"
brew "bat"
brew "prettyping"
brew "hub"
brew "ripgrep"
brew "fd"
# brew "openssh"
brew "screen"
brew "htop"
brew "nano"
brew "gnupg"
brew "tree"
brew "zopfli"
brew "node"
brew "yarn"
brew "ncdu" # find where your diskspace went
brew "terminal-notifier"
brew "rename"
brew "ssh-copy-id"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "fzf"

# Cask apps
cask_args appdir: "/Applications"
cask "android-platform-tools"
cask "alfred"
cask "spectacle"
cask "google-chrome"
cask "google-drive-file-stream"
cask "google-backup-and-sync"
cask "firefox"
cask "keepingyouawake"
cask "docker"
cask "iterm2"
cask "keybase"
cask "transmission"
cask "gitkraken"
cask "sensiblesidebuttons"
cask "visual-studio-code"
cask "slack"
cask 'vlc'
cask "zoomus"
cask "adguard"
# Fonts
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-fira-mono-for-powerline"
# Quicklook
cask "qlcolorcode" 
cask "qlstephen" 
cask "qlmarkdown" 
cask "quicklook-json" 
cask "qlprettypatch" 
cask "quicklook-csv" 
cask "betterzip" 
cask "qlimagesize" 
cask "suspicious-package"
cask "quicklookase" 
cask "qlvideo"
# App Store apps
# mas "Trello", id: 1278508951