# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/drivers"
tap "caskroom/fonts"
tap "caskroom/cask"
tap "bramstein/webfonttools"
# Formulae
# GNU core utilities (those that come with OS X are outdated)
brew "coreutils"
brew "moreutils"
# GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "findutils"
# GNU `sed`, overwriting the built-in `sed`
brew "gnu-sed", args:["with-default-names"]
brew "imagemagick", args:["with-webp"]
brew "ffmpeg", args:["with-libvpx"]
brew "wget", args:["with-iri"]
brew "bash"
brew "bash-completion2"
brew "brew-cask-completion"
brew "git"
brew "git-extras"
brew "grep"
brew "openssh"
brew "screen"
brew "nano"
brew "gnupg"
brew "tree"
brew "zopfli"
brew "node"
brew "ncdu" # find where your diskspace went
brew "terminal-notifier"
brew "rename"
brew "ssh-copy-id"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"
brew "zsh"
brew "zsh-syntax-highlighting"

# Cask apps
cask_args appdir: "/Applications"
cask "android-platform-tools"
cask "alfred"
cask "spectacle"
cask "enpass"
cask "google-chrome"
cask "google-drive-file-stream"
cask "google-backup-and-sync"
cask "firefox"
cask "caffeine"
cask "docker"
cask "iterm2"
cask "notion"
cask "sensiblesidebuttons"
cask "visual-studio-code"
cask "slack"
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask "whatsapp"
cask "discord"
cask "zoomus"
cask "teamviewer"
# Fonts
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-fira-mono-for-powerline"
# Quicklook
cask "qlcolorcode" 
cask "qlstephen" 
cask "qlmarkdown" 
cask "quicklook-json" 
cask "qlprettypatch" 
cask "quicklook-csv" 
cask "betterzip" 
cask "qlimagesize" 
cask "suspicious-package"
cask "quicklookase" 
cask "qlvideo"
# App Store apps
mas "Trello", id: 1278508951